app/controllers/airplanes_controller.rb

  def index
    @airplanes = Airplane.all
---
SELECT "airplanes".* FROM "airplanes"

  def show
    @airplane = Airplane.find(params[:id])
---
SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    @airplane = Airplane.new(airplane_params)

    respond_to do |format|
      if @airplane.save
---
INSERT INTO "airplanes" ("rows", "columns", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["rows", 2], ["columns", 2], ["name", "test"], ["created_at", "2021-11-10 06:16:19.073299"], ["updated_at", "2021-11-10 06:16:19.073299"]]

  def update
    respond_to do |format|
      if @airplane.update(airplane_params)
---
UPDATE "airplanes" SET "rows" = $1, "columns" = $2, "updated_at" = $3 WHERE "airplanes"."id" = $4  [["rows", 24], ["columns", 4], ["updated_at", "2021-11-10 06:15:00.580942"], ["id", 4]]

  def destroy
    @airplane.destroy
---
DELETE FROM "airplanes" WHERE "airplanes"."id" = $1  [["id", 8]]

    def set_airplane
      @airplane = Airplane.find(params[:id])
---
SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]