app/controllers/flights_controller.rb

INSERT INTO "flights" ("number", "origin", "destination", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["number", 25], ["origin", "new york"], ["destination", "los angeles"], ["date", "2021-11-16 00:00:00"], ["created_at", "2021-11-10 06:38:00.060737"], ["updated_at", "2021-11-10 06:38:00.060737"]]
---
  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save

UPDATE "flights" SET "airplane_id" = $1, "updated_at" = $2 WHERE "flights"."id" = $3  [["airplane_id", 1], ["updated_at", "2021-11-10 06:44:44.060145"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @flight.update(flight_params)

DELETE FROM "flights" WHERE "flights"."id" = $1  [["id", 4]]
---
  def destroy
    @flight.destroy